uhnp/src/InformationRegisters/СостоянияСотрудников/СостоянияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияСотрудника</types>
    </type>
  </resources>
  <resources>
    <name>ВидВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОкончаниеПредположительно</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СторнированиеНачислений</types>
      <types>DocumentRef.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком</types>
      <types>DocumentRef.ПростойСотрудников</types>
      <types>DocumentRef.ОтпускБезСохраненияОплатыСписком</types>
      <types>DocumentRef.Отпуск</types>
      <types>DocumentRef.БольничныйЛист</types>
      <types>DocumentRef.ПриостановлениеТрудовыхДоговоровКонтрактов</types>
      <types>DocumentRef.ОплатаПоСреднемуЗаработку</types>
      <types>DocumentRef.ОтгулСписком</types>
      <types>DocumentRef.ВозобновлениеТрудовыхДоговоровКонтрактов</types>
      <types>DocumentRef.ОплатаДнейУходаЗаДетьмиИнвалидами</types>
      <types>DocumentRef.НачальнаяШтатнаяРасстановка</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.ВосстановлениеВДолжности</types>
      <types>DocumentRef.НазначениеПодработки</types>
      <types>DocumentRef.ОтпускБезСохраненияОплаты</types>
      <types>DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</types>
      <types>DocumentRef.ПрогулНеявка</types>
      <types>DocumentRef.ПрогулНеявкаСписком</types>
      <types>DocumentRef.ПрекращениеПодработки</types>
      <types>DocumentRef.ПриемНаРаботу</types>
      <types>DocumentRef.Командировка</types>
      <types>DocumentRef.УвольнениеСписком</types>
      <types>DocumentRef.Отгул</types>
      <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
      <types>DocumentRef.ПереносДанных</types>
      <types>DocumentRef.ПериодыОплаченныеДоНачалаЭксплуатации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СведенияКонтрактаДоговораСотрудника/СведенияКонтрактаДоговораСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияКонтрактаДоговораСотрудника</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПредставительНанимателя</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПредставителяНанимателя</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ОснованиеПредставителяНанимателя</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВидАктаГосоргана</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрочныйДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СезонныйДоговор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокЗаключенияДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОснованиеСрочногоДоговора</name>
    <type>
      <types>CatalogRef.ОснованияЗаключенияСрочныхТрудовыхДоговоров</types>
    </type>
  </resources>
  <resources>
    <name>ОборудованиеРабочегоМеста</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ИныеУсловияДоговора</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСпособПоступленияНаСлужбу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПоложенныеВидыЕжегодныхОтпусков/ПоложенныеВидыЕжегодныхОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоложенныеВидыЕжегодныхОтпусков</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоДнейВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользуетсяПоОкончании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейВГодПоОкончании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВторичнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетНеТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЕжегодногоОтпуска</name>
    <type>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ВидыОтпусков/ВидыОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОтпусков</name>
  <predefined>
    <items>
      <name>ОтпускПострадавшимВАварииЧАЭС</name>
      <description>Дополнительный неоплачиваемый отпуск пострадавшим на ЧАЭС</description>
    </items>
    <items>
      <name>ОтпускПострадавшимВАварииЧАЭСОплачиваемый</name>
      <description>Дополнительный оплачиваемый отпуск пострадавшим на ЧАЭС</description>
    </items>
    <items>
      <name>ОтпускУчебный</name>
      <description>Дополнительный учебный отпуск (оплачиваемый)</description>
    </items>
    <items>
      <name>ОтпускБезОплатыУчебный</name>
      <description>Дополнительный учебный отпуск без оплаты</description>
    </items>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
    <items>
      <name>ОтпускЗаСвойСчет</name>
      <description>Отпуск без оплаты в соотв. с частью 1 статьи 128 ТК РФ</description>
    </items>
    <items>
      <name>ОтпускБезОплатыПоТКРФ</name>
      <description>Отпуск без оплаты в соотв. с частью 2 статьи 128 ТК РФ</description>
    </items>
    <items>
      <name>ОтпускЗаВредность</name>
      <description>Отпуск за вредность</description>
    </items>
    <items>
      <name>ОтпускЗаВыслугуЛет</name>
      <description>Отпуск за выслугу лет</description>
    </items>
    <items>
      <name>ОтпускЗаВыслугуЛетНаГосударственнойСлужбе</name>
      <description>Отпуск за выслугу лет на государственной службе</description>
    </items>
    <items>
      <name>ОтпускНаСанаторноКурортноеЛечение</name>
      <description>Отпуск на период санаторно-курортного лечения (за счет СФР)</description>
    </items>
    <items>
      <name>Северный</name>
      <description>Северный</description>
    </items>
  </predefined>
  <attributes>
    <name>ОтпускЯвляетсяЕжегодным</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаОтпуска</name>
    <type>
      <types>EnumRef.СпособыРасчетаОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставлятьОтпускВсемСотрудникам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейВГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтпускБезОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НакопительныйОтпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерЗависимостиДнейОтпуска</name>
    <type>
      <types>EnumRef.ХарактерЗависимостиКоличестваДнейОтпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтажа</name>
    <type>
      <types>CatalogRef.ВидыСтажа</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШкалаОценкиСтажа</name>
    <attributes>
      <name>ВерхняяГраницаИнтервалаСтажа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейВГод</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/CommonModules/ОстаткиОтпусковСобытия/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура-обработчик события "ПриЗаписи" регистра сведений СостоянияСотрудников.
//
Процедура УдалениеЗаработанныхПравНаОтпускПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	// проверка
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
		|	ВЫРАЗИТЬ(ТЗ.Состояние КАК Перечисление.СостоянияСотрудника) КАК Состояние,
		|	НАЧАЛОПЕРИОДА(ТЗ.Период, ДЕНЬ) КАК Период,
		|	НАЧАЛОПЕРИОДА(ТЗ.ДействуетДо, ДЕНЬ) КАК ДействуетДо
		|ПОМЕСТИТЬ НовыйНабор
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияСотрудников.Сотрудник КАК Сотрудник,
		|	СостоянияСотрудников.Состояние КАК Состояние,
		|	НАЧАЛОПЕРИОДА(СостоянияСотрудников.Период, ДЕНЬ) КАК Период,
		|	НАЧАЛОПЕРИОДА(СостоянияСотрудников.ДействуетДо, ДЕНЬ) КАК ДействуетДо
		|ПОМЕСТИТЬ СтарыйНабор
		|ИЗ
		|	РегистрСведений.СостоянияСотрудников КАК СостоянияСотрудников
		|ГДЕ
		|	СостоянияСотрудников.Сотрудник В(&Сотрудники)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НовыйНабор.Сотрудник, СтарыйНабор.Сотрудник) КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НовыйНабор.ДействуетДо, ДАТАВРЕМЯ(1, 1, 1)) <> ЕСТЬNULL(СтарыйНабор.ДействуетДо, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА ИСТИНА
		|		КОГДА НовыйНабор.Состояние ЕСТЬ NULL
		|				ИЛИ СтарыйНабор.Состояние ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НовыйНабор.Состояние <> СтарыйНабор.Состояние
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|	КОНЕЦ КАК БылиИзменения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НовыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА СтарыйНабор.Период
		|		КОГДА ЕСТЬNULL(СтарыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА НовыйНабор.Период
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(СтарыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(НовыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1))
		|					ТОГДА ЕСТЬNULL(НовыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1))
		|				ИНАЧЕ ЕСТЬNULL(СтарыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1))
		|			КОНЕЦ
		|	КОНЕЦ КАК РаннийПериод
		|ПОМЕСТИТЬ СравнительныйНабор
		|ИЗ
		|	НовыйНабор КАК НовыйНабор
		|		ПОЛНОЕ СОЕДИНЕНИЕ СтарыйНабор КАК СтарыйНабор
		|		ПО НовыйНабор.Сотрудник = СтарыйНабор.Сотрудник
		|			И НовыйНабор.Период = СтарыйНабор.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СравнительныйНабор.Сотрудник КАК Сотрудник,
		|	СравнительныйНабор.РаннийПериод КАК РаннийПериод
		|ПОМЕСТИТЬ ИзменившиесяЗаписи
		|ИЗ
		|	СравнительныйНабор КАК СравнительныйНабор
		|ГДЕ
		|	СравнительныйНабор.БылиИзменения = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзменившиесяЗаписи.Сотрудник КАК Сотрудник,
		|	МИНИМУМ(ИзменившиесяЗаписи.РаннийПериод) КАК Период
		|ИЗ
		|	ИзменившиесяЗаписи КАК ИзменившиесяЗаписи
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзменившиесяЗаписи.Сотрудник";
	
	ТаблицаНовыхДвижений = Источник.Выгрузить(,"Сотрудник,Состояние,ДействуетДо,Период");
	Запрос.УстановитьПараметр("Сотрудники", РегистрыБЗК.ЗначенияОтбораЗаписейНабора(Источник, Замещение, "Сотрудник"));
	Запрос.УстановитьПараметр("ТЗ", ТаблицаНовыхДвижений);

	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОстаткиОтпусков.УдалитьЗаписиЗаработанныхОтпусков(ТаблицаЗапроса);
	
КонецПроцедуры

// Процедура-обработчик события "ПриЗаписи" регистра сведений СведенияКонтрактаДоговораСотрудника.
//
Процедура СведенияКонтрактаДоговораУдалениеЗаработанныхПравНаОтпуск(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	// проверка
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Регистратор КАК Регистратор,
		|	ВЫРАЗИТЬ(ТЗ.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
		|	ТЗ.СрочныйДоговор КАК СрочныйДоговор,
		|	ТЗ.СезонныйДоговор КАК СезонныйДоговор,
		|	НАЧАЛОПЕРИОДА(ТЗ.Период, ДЕНЬ) КАК Период,
		|	НАЧАЛОПЕРИОДА(ТЗ.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания
		|ПОМЕСТИТЬ НовыйНабор
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияДоговора.Регистратор КАК Регистратор,
		|	СведенияДоговора.Сотрудник КАК Сотрудник,
		|	СведенияДоговора.СрочныйДоговор КАК СрочныйДоговор,
		|	СведенияДоговора.СезонныйДоговор КАК СезонныйДоговор,
		|	НАЧАЛОПЕРИОДА(СведенияДоговора.Период, ДЕНЬ) КАК Период,
		|	НАЧАЛОПЕРИОДА(СведенияДоговора.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания
		|ПОМЕСТИТЬ СтарыйНабор
		|ИЗ
		|	РегистрСведений.СведенияКонтрактаДоговораСотрудника КАК СведенияДоговора
		|ГДЕ
		|	СведенияДоговора.Регистратор В(&Регистраторы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НовыйНабор.Сотрудник, СтарыйНабор.Сотрудник) КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НовыйНабор.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) <> ЕСТЬNULL(СтарыйНабор.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1))
		|			ТОГДА ИСТИНА
		|		КОГДА НовыйНабор.СрочныйДоговор ЕСТЬ NULL
		|				ИЛИ СтарыйНабор.СрочныйДоговор ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		КОГДА НовыйНабор.СезонныйДоговор ЕСТЬ NULL
		|				ИЛИ СтарыйНабор.СезонныйДоговор ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		КОГДА НовыйНабор.СрочныйДоговор <> СтарыйНабор.СрочныйДоговор
		|			ТОГДА ИСТИНА
		|		КОГДА НовыйНабор.СезонныйДоговор <> СтарыйНабор.СезонныйДоговор
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК БылиИзменения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НовыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА СтарыйНабор.Период
		|		КОГДА ЕСТЬNULL(СтарыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА НовыйНабор.Период
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЕСТЬNULL(СтарыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1)) > ЕСТЬNULL(НовыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1))
		|					ТОГДА ЕСТЬNULL(НовыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1))
		|				ИНАЧЕ ЕСТЬNULL(СтарыйНабор.Период, ДАТАВРЕМЯ(1, 1, 1))
		|			КОНЕЦ
		|	КОНЕЦ КАК РаннийПериод
		|ПОМЕСТИТЬ СравнительныйНабор
		|ИЗ
		|	НовыйНабор КАК НовыйНабор
		|		ПОЛНОЕ СОЕДИНЕНИЕ СтарыйНабор КАК СтарыйНабор
		|		ПО НовыйНабор.Сотрудник = СтарыйНабор.Сотрудник
		|			И НовыйНабор.Период = СтарыйНабор.Период
		|			И НовыйНабор.Регистратор = СтарыйНабор.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СравнительныйНабор.Сотрудник КАК Сотрудник,
		|	СравнительныйНабор.РаннийПериод КАК РаннийПериод
		|ПОМЕСТИТЬ ИзменившиесяЗаписи
		|ИЗ
		|	СравнительныйНабор КАК СравнительныйНабор
		|ГДЕ
		|	СравнительныйНабор.БылиИзменения = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзменившиесяЗаписи.Сотрудник КАК Сотрудник,
		|	&ОсновнойОтпуск КАК ВидЕжегодногоОтпуска,
		|	МИНИМУМ(ИзменившиесяЗаписи.РаннийПериод) КАК Период
		|ИЗ
		|	ИзменившиесяЗаписи КАК ИзменившиесяЗаписи
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзменившиесяЗаписи.Сотрудник";
	
	ТаблицаНовыхДвижений = Источник.Выгрузить();
	Если Источник.Отбор.Найти("Регистратор") <> Неопределено И Источник.Отбор.Регистратор.Использование Тогда 
		ТаблицаНовыхДвижений.ЗаполнитьЗначения(Источник.Отбор.Регистратор.Значение, "Регистратор"); 
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОсновнойОтпуск", ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"));
	Запрос.УстановитьПараметр("Регистраторы", РегистрыБЗК.ЗначенияОтбораЗаписейНабора(Источник, Замещение, "Регистратор"));
	Запрос.УстановитьПараметр("ТЗ", ТаблицаНовыхДвижений);

	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ОстаткиОтпусков.УдалитьЗаписиЗаработанныхОтпусков(ТаблицаЗапроса);
	
КонецПроцедуры

Процедура РасчетПоложенныхПравНаОтпускаЗависящихОтСтажа(ОбрабатываемыйМесяц = Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	Если НЕ ЗначениеЗаполнено(ОбрабатываемыйМесяц) Тогда
		ОбрабатываемыйМесяц = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ОбрабатываемыйМесяц", ОбрабатываемыйМесяц);
	
	// Выбираем отпуска, зависящие от стажа.
	ОстаткиОтпусков.СоздатьВТВидыОтпусковЗависящиеОтСтажа(Запрос.МенеджерВременныхТаблиц);
	
	// Формируем срез последних на дату.
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ОбрабатываемыйМесяц КАК Период,
		|	ОтпускаЗависящиеОтСтажа.ВидЕжегодногоОтпуска
		|ПОМЕСТИТЬ ВТИзмеренияДатыОтпусковЗависящихОтСтажа
		|ИЗ
		|	ВТВидыОтпусковЗависящиеОтСтажа КАК ОтпускаЗависящиеОтСтажа";
	Запрос.Выполнить();
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
						"ВТИзмеренияДатыОтпусковЗависящихОтСтажа",
						"ВидЕжегодногоОтпуска,Период");
	ОстаткиОтпусков.СоздатьВТПоложенныеВидыЕжегодныхОтпусков(Запрос.МенеджерВременныхТаблиц, ОписаниеФильтра);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоложенныеВидыЕжегодныхОтпусков.Сотрудник,
		|	ПоложенныеВидыЕжегодныхОтпусков.ВидЕжегодногоОтпуска,
		|	ПоложенныеВидыЕжегодныхОтпусков.Период,
		|	ПоложенныеВидыЕжегодныхОтпусков.Регистратор
		|ПОМЕСТИТЬ ВТОтборОтпусков
		|ИЗ
		|	ВТПоложенныеВидыЕжегодныхОтпусков КАК ПоложенныеВидыЕжегодныхОтпусков
		|ГДЕ
		|	НЕ ПоложенныеВидыЕжегодныхОтпусков.ПересчетНеТребуется
		|	И ПоложенныеВидыЕжегодныхОтпусков.ПериодЗаписи <> ПоложенныеВидыЕжегодныхОтпусков.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОтборОтпусков.Сотрудник,
		|	ДОБАВИТЬКДАТЕ(ОтборОтпусков.Период, МЕСЯЦ, -1) КАК Период,
		|	КОНЕЦПЕРИОДА(ОтборОтпусков.Период, МЕСЯЦ) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиПериоды
		|ИЗ
		|	ВТОтборОтпусков КАК ОтборОтпусков";
	Запрос.Выполнить();
	
	// Получаем стажи сотрудников.
	КадровыйУчетРасширенный.СоздатьВТПериодыИзмененияСтажа(Запрос.МенеджерВременныхТаблиц);
	
	// Добавляем разрез вида отпуска и протаскиваем регистратор.
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтборОтпусков.Сотрудник,
		|	ОтборОтпусков.ВидЕжегодногоОтпуска,
		|	ОтборОтпусков.Регистратор,
		|	ВТВидыОтпусковЗависящиеОтСтажа.ВидСтажа
		|ПОМЕСТИТЬ ВТОтборОтпусковСоСтажами
		|ИЗ
		|	ВТОтборОтпусков КАК ОтборОтпусков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВидыОтпусковЗависящиеОтСтажа КАК ВТВидыОтпусковЗависящиеОтСтажа
		|		ПО ОтборОтпусков.ВидЕжегодногоОтпуска = ВТВидыОтпусковЗависящиеОтСтажа.ВидЕжегодногоОтпуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыИзмененияСтажа.Сотрудник,
		|	ОтборОтпусков.ВидЕжегодногоОтпуска,
		|	ПериодыИзмененияСтажа.ВидСтажа,
		|	ПериодыИзмененияСтажа.ДатаСтажа,
		|	ПериодыИзмененияСтажа.ЗначениеСтажа,
		|	ОтборОтпусков.Регистратор
		|ПОМЕСТИТЬ ВТПериодыИзмененияСтажаОтпусков
		|ИЗ
		|	ВТПериодыИзмененияСтажа КАК ПериодыИзмененияСтажа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборОтпусковСоСтажами КАК ОтборОтпусков
		|		ПО ПериодыИзмененияСтажа.Сотрудник = ОтборОтпусков.Сотрудник
		|			И ПериодыИзмененияСтажа.ВидСтажа = ОтборОтпусков.ВидСтажа";
	Запрос.Выполнить();
	
	// Подготавливаем шкалу стаж-показатель.
	ОстаткиОтпусков.СоздатьВТШкалыСтажевыхОтпусковСоСледующимиПоказателями(Запрос.МенеджерВременныхТаблиц, "ВТВидыОтпусковЗависящиеОтСтажа");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПериодыИзмененияСтажаОтпусков.Сотрудник,
		|	ПериодыИзмененияСтажаОтпусков.ВидЕжегодногоОтпуска,
		|	ПериодыИзмененияСтажаОтпусков.Регистратор,
		|	ПериодыИзмененияСтажаОтпусков.ЗначениеСтажа,
		|	МАКСИМУМ(ШкалыСтажевыхОтпусковСоСледующимиПоказателями.ВерхняяГраницаИнтервалаСтажа) КАК ВерхняяГраницаИнтервалаСтажа
		|ПОМЕСТИТЬ ВТУказателиЗначенийОтпусковСотрудников
		|ИЗ
		|	ВТПериодыИзмененияСтажаОтпусков КАК ПериодыИзмененияСтажаОтпусков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШкалыСтажевыхОтпусковСоСледующимиПоказателями КАК ШкалыСтажевыхОтпусковСоСледующимиПоказателями
		|		ПО ПериодыИзмененияСтажаОтпусков.ВидЕжегодногоОтпуска = ШкалыСтажевыхОтпусковСоСледующимиПоказателями.ВидЕжегодногоОтпуска
		|			И ПериодыИзмененияСтажаОтпусков.ЗначениеСтажа >= ШкалыСтажевыхОтпусковСоСледующимиПоказателями.ВерхняяГраницаИнтервалаСтажа
		|
		|СГРУППИРОВАТЬ ПО
		|	ПериодыИзмененияСтажаОтпусков.ВидЕжегодногоОтпуска,
		|	ПериодыИзмененияСтажаОтпусков.ЗначениеСтажа,
		|	ПериодыИзмененияСтажаОтпусков.Сотрудник,
		|	ПериодыИзмененияСтажаОтпусков.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УказателиЗначенийОтпусковСотрудников.Сотрудник,
		|	УказателиЗначенийОтпусковСотрудников.ВидЕжегодногоОтпуска,
		|	УказателиЗначенийОтпусковСотрудников.Регистратор,
		|	ШкалыСтажевыхОтпусковСоСледующимиПоказателями.КоличествоДнейВГодСледующее КАК КоличествоДней
		|ПОМЕСТИТЬ ВТИтоговыеЗначенияОтпусков
		|ИЗ
		|	ВТУказателиЗначенийОтпусковСотрудников КАК УказателиЗначенийОтпусковСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШкалыСтажевыхОтпусковСоСледующимиПоказателями КАК ШкалыСтажевыхОтпусковСоСледующимиПоказателями
		|		ПО УказателиЗначенийОтпусковСотрудников.ВидЕжегодногоОтпуска = ШкалыСтажевыхОтпусковСоСледующимиПоказателями.ВидЕжегодногоОтпуска
		|			И УказателиЗначенийОтпусковСотрудников.ВерхняяГраницаИнтервалаСтажа = ШкалыСтажевыхОтпусковСоСледующимиПоказателями.ВерхняяГраницаИнтервалаСтажа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИтоговыеЗначенияОтпусков.Регистратор КАК Регистратор,
		|	КОЛИЧЕСТВО(ВТИтоговыеЗначенияОтпусков.Регистратор) КАК КоличествоРегистраторов
		|ИЗ
		|	ВТИтоговыеЗначенияОтпусков КАК ВТИтоговыеЗначенияОтпусков
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТИтоговыеЗначенияОтпусков.Регистратор
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ВТИтоговыеЗначенияОтпусков.Регистратор) > 1";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ОбновляемыеРегистраторы = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Регистратор");
		
		Для каждого ОбновляемыйРегистратор Из ОбновляемыеРегистраторы Цикл
			// Получим набор записей регистратора.
			Набор = РегистрыСведений.ПоложенныеВидыЕжегодныхОтпусков.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(ОбновляемыйРегистратор);
			Набор.Прочитать();
			// Генерируем для него вторичные стажевые записи.
			МенеджерВременныхТаблицПоНаборуЗаписей = Новый МенеджерВременныхТаблиц;
			ОстаткиОтпусков.СоздатьВТСведенияОДвиженииПоложенныхОтпусковЗависящихОтСтажа(Набор, МенеджерВременныхТаблицПоНаборуЗаписей, Истина);
			Если ОстаткиОтпусков.ДополнитьНаборЗаписейПоложенныеВидыЕжегодныхОтпусковВторичнымиЗаписями(Набор, МенеджерВременныхТаблицПоНаборуЗаписей, Истина) Тогда
				Набор.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
				Набор.ДополнительныеСвойства.Вставить("НеДобавлятьВторичныеЗаписи", Истина);
				Набор.Записать();
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
